[View in Colaboratory](https://colab.research.google.com/drive/11GDjIKG_cGfo1ct_9Kmb446qWyt6VdzU)
# DataFrames

We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A -1.194705 -0.710621 -0.271802 -0.250693
B  1.728314 -0.916221 -0.354905  0.104467
C -0.555354  0.819738 -0.412452  0.024816
D  0.357190 -0.328951  1.709532 -0.436240
E  1.246736  1.648675  0.289433 -1.353644

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [5]:
df['W']

A   -1.194705
B    1.728314
C   -0.555354
D    0.357190
E    1.246736
Name: W, dtype: float64

In [6]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A -1.194705 -0.250693
B  1.728314  0.104467
C -0.555354  0.024816
D  0.357190 -0.436240
E  1.246736 -1.353644

DataFrame Columns are just Series

In [7]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [8]:
df['new'] = df['W'] + df['Y']

In [9]:
df

          W         X         Y         Z       new
A -1.194705 -0.710621 -0.271802 -0.250693 -1.466507
B  1.728314 -0.916221 -0.354905  0.104467  1.373409
C -0.555354  0.819738 -0.412452  0.024816 -0.967807
D  0.357190 -0.328951  1.709532 -0.436240  2.066722
E  1.246736  1.648675  0.289433 -1.353644  1.536168

**Removing Columns**

In [10]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.194705 -0.710621 -0.271802 -0.250693
B  1.728314 -0.916221 -0.354905  0.104467
C -0.555354  0.819738 -0.412452  0.024816
D  0.357190 -0.328951  1.709532 -0.436240
E  1.246736  1.648675  0.289433 -1.353644

In [11]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -1.194705 -0.710621 -0.271802 -0.250693 -1.466507
B  1.728314 -0.916221 -0.354905  0.104467  1.373409
C -0.555354  0.819738 -0.412452  0.024816 -0.967807
D  0.357190 -0.328951  1.709532 -0.436240  2.066722
E  1.246736  1.648675  0.289433 -1.353644  1.536168

In [12]:
df.drop('new',axis=1,inplace=True)

In [13]:
df

          W         X         Y         Z
A -1.194705 -0.710621 -0.271802 -0.250693
B  1.728314 -0.916221 -0.354905  0.104467
C -0.555354  0.819738 -0.412452  0.024816
D  0.357190 -0.328951  1.709532 -0.436240
E  1.246736  1.648675  0.289433 -1.353644

Can also drop rows this way:

In [14]:
df.drop('E',axis=0)

          W         X         Y         Z
A -1.194705 -0.710621 -0.271802 -0.250693
B  1.728314 -0.916221 -0.354905  0.104467
C -0.555354  0.819738 -0.412452  0.024816
D  0.357190 -0.328951  1.709532 -0.436240

**Selecting Rows**

In [15]:
df.loc['A']

W   -1.194705
X   -0.710621
Y   -0.271802
Z   -0.250693
Name: A, dtype: float64

Or select based off of position instead of label

In [16]:
df.iloc[2]

W   -0.555354
X    0.819738
Y   -0.412452
Z    0.024816
Name: C, dtype: float64

**Selecting subset of rows and columns**

In [17]:
df.loc['B','Y']

-0.3549051407825037

In [18]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.194705 -0.271802
B  1.728314 -0.354905

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [19]:
df

          W         X         Y         Z
A -1.194705 -0.710621 -0.271802 -0.250693
B  1.728314 -0.916221 -0.354905  0.104467
C -0.555354  0.819738 -0.412452  0.024816
D  0.357190 -0.328951  1.709532 -0.436240
E  1.246736  1.648675  0.289433 -1.353644

In [20]:
df>0

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C  False   True  False   True
D   True  False   True  False
E   True   True   True  False

In [21]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN       NaN
B  1.728314       NaN       NaN  0.104467
C       NaN  0.819738       NaN  0.024816
D  0.357190       NaN  1.709532       NaN
E  1.246736  1.648675  0.289433       NaN

In [22]:
df.loc[df['W']>0]

          W         X         Y         Z
B  1.728314 -0.916221 -0.354905  0.104467
D  0.357190 -0.328951  1.709532 -0.436240
E  1.246736  1.648675  0.289433 -1.353644

In [23]:
df.loc[df['W']>0]['Y']

B   -0.354905
D    1.709532
E    0.289433
Name: Y, dtype: float64

In [24]:
df.loc[df['W']>0][['Y','X']]

          Y         X
B -0.354905 -0.916221
D  1.709532 -0.328951
E  0.289433  1.648675

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [25]:
df

          W         X         Y         Z
A -1.194705 -0.710621 -0.271802 -0.250693
B  1.728314 -0.916221 -0.354905  0.104467
C -0.555354  0.819738 -0.412452  0.024816
D  0.357190 -0.328951  1.709532 -0.436240
E  1.246736  1.648675  0.289433 -1.353644

In [26]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A -1.194705 -0.710621 -0.271802 -0.250693
1     B  1.728314 -0.916221 -0.354905  0.104467
2     C -0.555354  0.819738 -0.412452  0.024816
3     D  0.357190 -0.328951  1.709532 -0.436240
4     E  1.246736  1.648675  0.289433 -1.353644

In [27]:
newind = 'CA NY WY OR CO'.split()

In [28]:
df['States'] = newind

In [29]:
df

          W         X         Y         Z States
A -1.194705 -0.710621 -0.271802 -0.250693     CA
B  1.728314 -0.916221 -0.354905  0.104467     NY
C -0.555354  0.819738 -0.412452  0.024816     WY
D  0.357190 -0.328951  1.709532 -0.436240     OR
E  1.246736  1.648675  0.289433 -1.353644     CO

In [30]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.194705 -0.710621 -0.271802 -0.250693
NY      1.728314 -0.916221 -0.354905  0.104467
WY     -0.555354  0.819738 -0.412452  0.024816
OR      0.357190 -0.328951  1.709532 -0.436240
CO      1.246736  1.648675  0.289433 -1.353644

In [31]:
df

          W         X         Y         Z States
A -1.194705 -0.710621 -0.271802 -0.250693     CA
B  1.728314 -0.916221 -0.354905  0.104467     NY
C -0.555354  0.819738 -0.412452  0.024816     WY
D  0.357190 -0.328951  1.709532 -0.436240     OR
E  1.246736  1.648675  0.289433 -1.353644     CO

In [32]:
df.set_index('States',inplace=True)

In [33]:
df

               W         X         Y         Z
States
CA     -1.194705 -0.710621 -0.271802 -0.250693
NY      1.728314 -0.916221 -0.354905  0.104467
WY     -0.555354  0.819738 -0.412452  0.024816
OR      0.357190 -0.328951  1.709532 -0.436240
CO      1.246736  1.648675  0.289433 -1.353644

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [34]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [35]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [36]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.265325  1.471929
   2  2.968603 -0.120451
   3 -0.020041 -1.351493
G2 1 -0.957535 -0.187058
   2 -2.575830 -0.857064
   3 -2.533439  0.278084

Let's see how to index this! Calling one level of the index returns the sub-dataframe:

In [37]:
df.loc['G1']

          A         B
1 -0.265325  1.471929
2  2.968603 -0.120451
3 -0.020041 -1.351493

In [38]:
df.index.names = ['Group','Num']

In [39]:
df

                  A         B
Group Num
G1    1   -0.265325  1.471929
      2    2.968603 -0.120451
      3   -0.020041 -1.351493
G2    1   -0.957535 -0.187058
      2   -2.575830 -0.857064
      3   -2.533439  0.278084

In [40]:
df.loc['G1']

            A         B
Num
1   -0.265325  1.471929
2    2.968603 -0.120451
3   -0.020041 -1.351493